Revit 2027 API
SpecTypeId.CostPerArea Property
 Cost per Area, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CostPerArea { get; }
Public Shared ReadOnly Property CostPerArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CostPerArea {
	ForgeTypeId^ get ();
}
static member CostPerArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace